### Terraform Plan (staging)

<details>
<summary>Click to expand plan</summary>

```
[command]/home/runner/work/_temp/c6a2a70f-e887-413c-ab96-c55386a3d716/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.file_uploader.module.api_gateway.aws_api_gateway_account.account will be created
  + resource "aws_api_gateway_account" "account" {
      + api_key_version     = (known after apply)
      + cloudwatch_role_arn = (known after apply)
      + features            = (known after apply)
      + id                  = (known after apply)
      + region              = "eu-central-1"
      + throttle_settings   = (known after apply)
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_base_path_mapping.api_mapping will be created
  + resource "aws_api_gateway_base_path_mapping" "api_mapping" {
      + api_id      = (known after apply)
      + domain_name = "staging-api-file-upload.epic-trip-planner.com"
      + id          = (known after apply)
      + region      = "eu-central-1"
      + stage_name  = "staging"
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_deployment.deployment will be created
  + resource "aws_api_gateway_deployment" "deployment" {
      + created_date = (known after apply)
      + id           = (known after apply)
      + region       = "eu-central-1"
      + rest_api_id  = (known after apply)
      + triggers     = (known after apply)
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_domain_name.api will be created
  + resource "aws_api_gateway_domain_name" "api" {
      + arn                                    = (known after apply)
      + certificate_upload_date                = (known after apply)
      + cloudfront_domain_name                 = (known after apply)
      + cloudfront_zone_id                     = (known after apply)
      + domain_name                            = "staging-api-file-upload.epic-trip-planner.com"
      + domain_name_id                         = (known after apply)
      + id                                     = (known after apply)
      + ownership_verification_certificate_arn = (known after apply)
      + region                                 = "eu-central-1"
      + regional_certificate_arn               = "arn:aws:acm:eu-central-1:387836084035:certificate/1543124e-071b-432e-af17-040651803d38"
      + regional_domain_name                   = (known after apply)
      + regional_zone_id                       = (known after apply)
      + security_policy                        = "TLS_1_2"
      + tags                                   = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
          + "Name"        = "staging-api-file-upload.epic-trip-planner.com"
        }
      + tags_all                               = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
          + "Name"        = "staging-api-file-upload.epic-trip-planner.com"
        }

      + endpoint_configuration {
          + ip_address_type = (known after apply)
          + types           = [
              + "REGIONAL",
            ]
        }
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_integration.lambda_integration will be created
  + resource "aws_api_gateway_integration" "lambda_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "eu-central-1"
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_integration.options_integration will be created
  + resource "aws_api_gateway_integration" "options_integration" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "OPTIONS"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + region               = "eu-central-1"
      + request_templates    = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id          = (known after apply)
      + rest_api_id          = (known after apply)
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_integration_response.options_integration_response will be created
  + resource "aws_api_gateway_integration_response" "options_integration_response" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "eu-central-1"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,x-api-gateway-file-upload-auth,X-Requested-With,Accept,Origin'"
          + "method.response.header.Access-Control-Allow-Methods" = "'GET,OPTIONS,PUT'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_method.get_method will be created
  + resource "aws_api_gateway_method" "get_method" {
      + api_key_required   = false
      + authorization      = "NONE"
      + http_method        = "GET"
      + id                 = (known after apply)
      + region             = "eu-central-1"
      + request_parameters = {
          + "method.request.header.x-api-gateway-file-upload-auth" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_method.options_method will be created
  + resource "aws_api_gateway_method" "options_method" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "eu-central-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_method_response.options_response will be created
  + resource "aws_api_gateway_method_response" "options_response" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "eu-central-1"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_resource.file_upload_url_resource will be created
  + resource "aws_api_gateway_resource" "file_upload_url_resource" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "upload-url"
      + region      = "eu-central-1"
      + rest_api_id = (known after apply)
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_rest_api.api will be created
  + resource "aws_api_gateway_rest_api" "api" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "API Gateway for requesting pre-signed url"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "staging-get-presigned-url-api"
      + policy                       = (known after apply)
      + region                       = "eu-central-1"
      + root_resource_id             = (known after apply)
      + tags                         = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
          + "Name"        = "staging-get-presigned-url-api"
        }
      + tags_all                     = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
          + "Name"        = "staging-get-presigned-url-api"
        }
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_stage.api_gateway_stage will be created
  + resource "aws_api_gateway_stage" "api_gateway_stage" {
      + arn                  = (known after apply)
      + deployment_id        = (known after apply)
      + execution_arn        = (known after apply)
      + id                   = (known after apply)
      + invoke_url           = (known after apply)
      + region               = "eu-central-1"
      + rest_api_id          = (known after apply)
      + stage_name           = "staging"
      + tags_all             = (known after apply)
      + web_acl_arn          = (known after apply)
      + xray_tracing_enabled = true

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = jsonencode(
                {
                  + caller         = "$context.identity.caller"
                  + httpMethod     = "$context.httpMethod"
                  + ip             = "$context.identity.sourceIp"
                  + protocol       = "$context.protocol"
                  + requestId      = "$context.requestId"
                  + requestTime    = "$context.requestTime"
                  + resourcePath   = "$context.resourcePath"
                  + responseLength = "$context.responseLength"
                  + status         = "$context.status"
                  + user           = "$context.identity.user"
                }
            )
        }
    }

  # module.file_uploader.module.api_gateway.aws_cloudwatch_log_group.api_gateway will be created
  + resource "aws_cloudwatch_log_group" "api_gateway" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/apigw/staging-file-uploader"
      + name_prefix       = (known after apply)
      + region            = "eu-central-1"
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.file_uploader.module.api_gateway.aws_cloudwatch_log_group.apigw_access_logs will be created
  + resource "aws_cloudwatch_log_group" "apigw_access_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/apigateway/staging-file-uploader-access-logs"
      + name_prefix       = (known after apply)
      + region            = "eu-central-1"
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.file_uploader.module.api_gateway.aws_iam_role.cloudwatch_role will be created
  + resource "aws_iam_role" "cloudwatch_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "apigateway.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "staging-apigw-cloudwatch-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.file_uploader.module.api_gateway.aws_iam_role_policy_attachment.cloudwatch_attachment will be created
  + resource "aws_iam_role_policy_attachment" "cloudwatch_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonAPIGatewayPushToCloudWatchLogs"
      + role       = "staging-apigw-cloudwatch-role"
    }

  # module.file_uploader.module.api_gateway.aws_lambda_permission.apigw_permission will be created
  + resource "aws_lambda_permission" "apigw_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "eu-central-1"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.file_uploader.module.dynamodb.aws_dynamodb_table.files_metadata_table will be created
  + resource "aws_dynamodb_table" "files_metadata_table" {
      + arn                         = (known after apply)
      + billing_mode                = "PAY_PER_REQUEST"
      + deletion_protection_enabled = false
      + hash_key                    = "id"
      + id                          = (known after apply)
      + name                        = "staging-files-metadata"
      + range_key                   = "file_key"
      + read_capacity               = (known after apply)
      + region                      = "eu-central-1"
      + stream_arn                  = (known after apply)
      + stream_label                = (known after apply)
      + stream_view_type            = (known after apply)
      + tags                        = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
        }
      + tags_all                    = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
        }
      + write_capacity              = (known after apply)

      + attribute {
          + name = "file_key"
          + type = "S"
        }
      + attribute {
          + name = "id"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled                 = true
          + recovery_period_in_days = (known after apply)
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }
    }

  # module.file_uploader.module.file_scanning.aws_lambda_permission.allow_s3_to_invoke_process_uploaded_file[0] will be created
  + resource "aws_lambda_permission" "allow_s3_to_invoke_process_uploaded_file" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "s3.amazonaws.com"
      + region              = "eu-central-1"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromS3"
      + statement_id_prefix = (known after apply)
    }

  # module.file_uploader.module.file_scanning.aws_s3_bucket_notification.source_notification[0] will be created
  + resource "aws_s3_bucket_notification" "source_notification" {
      + bucket      = (known after apply)
      + eventbridge = false
      + id          = (known after apply)
      + region      = "eu-central-1"

      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
            ]
          + filter_prefix       = "uploads/"
          + id                  = (known after apply)
          + lambda_function_arn = (known after apply)
        }
    }

  # module.file_uploader.module.lambda_functions["get_presigned_url"].aws_iam_policy.lambda_custom_policy will be created
  + resource "aws_iam_policy" "lambda_custom_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Custom policy for get-presigned-url lambda"
      + id               = (known after apply)
      + name             = "staging-lambda-get-presigned-url-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
        }
      + tags_all         = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
        }
    }

  # module.file_uploader.module.lambda_functions["get_presigned_url"].aws_iam_role.lambda_exec_role will be created
  + resource "aws_iam_role" "lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "staging-lambda-get-presigned-url-exec-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
        }
      + tags_all              = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
        }
      + unique_id             = (known after apply)
    }

  # module.file_uploader.module.lambda_functions["get_presigned_url"].aws_iam_role_policy_attachment.lambda_custom_policy_attach will be created
  + resource "aws_iam_role_policy_attachment" "lambda_custom_policy_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "staging-lambda-get-presigned-url-exec-role"
    }

  # module.file_uploader.module.lambda_functions["get_presigned_url"].aws_iam_role_policy_attachment.lambda_logging will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logging" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "staging-lambda-get-presigned-url-exec-role"
    }

  # module.file_uploader.module.lambda_functions["get_presigned_url"].aws_lambda_function.lambda_function will be created
  + resource "aws_lambda_function" "lambda_function" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/file_uploader/submodules/lambda_function/lambda_get-presigned-url.zip"
      + function_name                  = "staging-get-presigned-url-lambda"
      + handler                        = "getPresignedUrl.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "eu-central-1"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs20.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "vdnZGl6ZP3krBq1LCIU+vPjAzXs2OCvKzIpgo+JmxzQ="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
          + "Name"        = "staging-get-presigned-url-lambda"
        }
      + tags_all                       = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
          + "Name"        = "staging-get-presigned-url-lambda"
        }
      + timeout                        = 5
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }
    }

  # module.file_uploader.module.lambda_functions["process_uploaded_file"].aws_iam_policy.lambda_custom_policy will be created
  + resource "aws_iam_policy" "lambda_custom_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Custom policy for process-uploaded-file lambda"
      + id               = (known after apply)
      + name             = "staging-lambda-process-uploaded-file-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
        }
      + tags_all         = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
        }
    }

  # module.file_uploader.module.lambda_functions["process_uploaded_file"].aws_iam_role.lambda_exec_role will be created
  + resource "aws_iam_role" "lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "staging-lambda-process-uploaded-file-exec-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
        }
      + tags_all              = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
        }
      + unique_id             = (known after apply)
    }

  # module.file_uploader.module.lambda_functions["process_uploaded_file"].aws_iam_role_policy_attachment.lambda_custom_policy_attach will be created
  + resource "aws_iam_role_policy_attachment" "lambda_custom_policy_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "staging-lambda-process-uploaded-file-exec-role"
    }

  # module.file_uploader.module.lambda_functions["process_uploaded_file"].aws_iam_role_policy_attachment.lambda_logging will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logging" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "staging-lambda-process-uploaded-file-exec-role"
    }

  # module.file_uploader.module.lambda_functions["process_uploaded_file"].aws_lambda_function.lambda_function will be created
  + resource "aws_lambda_function" "lambda_function" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/file_uploader/submodules/lambda_function/lambda_process-uploaded-file.zip"
      + function_name                  = "staging-process-uploaded-file-lambda"
      + handler                        = "processUploadedFile.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "eu-central-1"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs20.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "qDrbUb61k0izBHOCeOb1APZFC4S9tBkZGIanpU5QpRw="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
          + "Name"        = "staging-process-uploaded-file-lambda"
        }
      + tags_all                       = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
          + "Name"        = "staging-process-uploaded-file-lambda"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "BUCKET_AV_ENABLED" = "false"
              + "DYNAMO_TABLE"      = "staging-files-metadata"
              + "PARTITION_KEY"     = "id"
              + "SORT_KEY"          = "file_key"
              + "THUMBNAIL_FOLDER"  = "thumbnails/"
              + "UPLOAD_FOLDER"     = "uploads/"
            }
        }
    }

  # module.file_uploader.module.route53.aws_route53_record.api will be created
  + resource "aws_route53_record" "api" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "staging-api-file-upload.epic-trip-planner.com"
      + type            = "A"
      + zone_id         = "Z06898151VJN25FUVRO5O"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.file_uploader.module.s3_bucket.aws_kms_key.s3_cmk will be created
  + resource "aws_kms_key" "s3_cmk" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "CMK for S3 uploads and access logs"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::387836084035:root"
                        }
                      + Resource  = "*"
                      + Sid       = "AllowRootAccount"
                    },
                  + {
                      + Action    = [
                          + "kms:*",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::387836084035:role/gitHubFileUploader"
                        }
                      + Resource  = "*"
                      + Sid       = "AllowGithubActions"
                    },
                  + {
                      + Action    = [
                          + "kms:Encrypt",
                          + "kms:GenerateDataKey",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "aws:SourceAccount" = "387836084035"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "logging.s3.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "AllowS3Logging"
                    },
                  + {
                      + Action    = [
                          + "kms:Encrypt",
                          + "kms:Decrypt",
                          + "kms:GenerateDataKey",
                          + "kms:ReEncrypt*",
                          + "kms:DescribeKey",
                        ]
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::387836084035:role/*-lambda-*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = "AllowLambdasUseOfKey"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region                             = "eu-central-1"
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = (known after apply)
    }

  # module.file_uploader.module.s3_bucket.aws_s3_bucket.log_target will be created
  + resource "aws_s3_bucket" "log_target" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "staging-file-uploader-s3-access-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "eu-central-1"
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.file_uploader.module.s3_bucket.aws_s3_bucket.uploads will be created
  + resource "aws_s3_bucket" "uploads" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "staging-file-uploader-file-upload-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "eu-central-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "App"         = "file-uploader"
          + "Description" = "Bucket for storing uploaded files and geenrated thumbnails"
          + "Environment" = "staging"
          + "Name"        = "staging-uploads-bucket"
        }
      + tags_all                    = {
          + "App"         = "file-uploader"
          + "Description" = "Bucket for storing uploaded files and geenrated thumbnails"
          + "Environment" = "staging"
          + "Name"        = "staging-uploads-bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.file_uploader.module.s3_bucket.aws_s3_bucket_accelerate_configuration.uploads_acceleration[0] will be created
  + resource "aws_s3_bucket_accelerate_configuration" "uploads_acceleration" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "eu-central-1"
      + status = "Enabled"
    }

  # module.file_uploader.module.s3_bucket.aws_s3_bucket_cors_configuration.uploads_cors will be created
  + resource "aws_s3_bucket_cors_configuration" "uploads_cors" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "eu-central-1"

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "GET",
              + "HEAD",
              + "PUT",
            ]
          + allowed_origins = [
              + "*",
            ]
          + expose_headers  = [
              + "ETag",
            ]
          + max_age_seconds = 3000
        }
    }

  # module.file_uploader.module.s3_bucket.aws_s3_bucket_logging.uploads_logging will be created
  + resource "aws_s3_bucket_logging" "uploads_logging" {
      + bucket        = (known after apply)
      + id            = (known after apply)
      + region        = "eu-central-1"
      + target_bucket = (known after apply)
      + target_prefix = "staging-file-uploader-uploads-access-logs/"
    }

  # module.file_uploader.module.s3_bucket.aws_s3_bucket_ownership_controls.log_target_ownership will be created
  + resource "aws_s3_bucket_ownership_controls" "log_target_ownership" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "eu-central-1"

      + rule {
          + object_ownership = "BucketOwnerEnforced"
        }
    }

  # module.file_uploader.module.s3_bucket.aws_s3_bucket_policy.log_target_policy will be created
  + resource "aws_s3_bucket_policy" "log_target_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
      + region = "eu-central-1"
    }

  # module.file_uploader.module.s3_bucket.aws_s3_bucket_public_access_block.log_target_block will be created
  + resource "aws_s3_bucket_public_access_block" "log_target_block" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "eu-central-1"
      + restrict_public_buckets = true
    }

  # module.file_uploader.module.s3_bucket.aws_s3_bucket_public_access_block.uploads_public_access will be created
  + resource "aws_s3_bucket_public_access_block" "uploads_public_access" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "eu-central-1"
      + restrict_public_buckets = true
    }

  # module.file_uploader.module.s3_bucket.aws_s3_bucket_server_side_encryption_configuration.log_target_sse will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "log_target_sse" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "eu-central-1"

      + rule {
          + blocked_encryption_types = []

          + apply_server_side_encryption_by_default {
              + kms_master_key_id = (known after apply)
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.file_uploader.module.s3_bucket.aws_s3_bucket_server_side_encryption_configuration.uploads_encryption will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "uploads_encryption" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "eu-central-1"

      + rule {
          + blocked_encryption_types = []

          + apply_server_side_encryption_by_default {
              + kms_master_key_id = (known after apply)
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.file_uploader.module.s3_bucket.aws_s3_bucket_versioning.log_target_versioning will be created
  + resource "aws_s3_bucket_versioning" "log_target_versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "eu-central-1"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.file_uploader.module.s3_bucket.aws_s3_bucket_versioning.uploads_versioning will be created
  + resource "aws_s3_bucket_versioning" "uploads_versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "eu-central-1"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.file_uploader.module.waf.aws_wafv2_web_acl.api_gw_waf will be created
  + resource "aws_wafv2_web_acl" "api_gw_waf" {
      + application_integration_url = (known after apply)
      + arn                         = (known after apply)
      + capacity                    = (known after apply)
      + description                 = "WAF for API Gateway"
      + id                          = (known after apply)
      + lock_token                  = (known after apply)
      + name                        = "staging-file-uploader-api-gw-waf"
      + name_prefix                 = (known after apply)
      + region                      = "eu-central-1"
      + scope                       = "REGIONAL"
      + tags                        = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
          + "Name"        = "staging-file-uploader-api-gw-waf"
        }
      + tags_all                    = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
          + "Name"        = "staging-file-uploader-api-gw-waf"
        }

      + default_action {
          + allow {
            }
        }

      + rule {
          + name     = "staging-RateLimitPerIP"
          + priority = 200

          + action {
              + block {
                }
            }

          + statement {
              + rate_based_statement {
                  + aggregate_key_type    = "IP"
                  + evaluation_window_sec = 300
                  + limit                 = 1000
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "staging-rateLimit"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "staging-AWSManagedRulesCommonRuleSet"
          + priority = 1

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "staging-managedRules"
              + sampled_requests_enabled   = true
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
          + metric_name                = "staging-fileUploaderApiGwWAF"
          + sampled_requests_enabled   = true
        }
    }

  # module.file_uploader.module.waf.aws_wafv2_web_acl_association.api_gw_assoc will be created
  + resource "aws_wafv2_web_acl_association" "api_gw_assoc" {
      + id           = (known after apply)
      + region       = "eu-central-1"
      + resource_arn = (known after apply)
      + web_acl_arn  = (known after apply)
    }

Plan: 48 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_gateway_invoke_url = "https://staging-api-file-upload.epic-trip-planner.com/upload-url"
  + uploads_bucket_arn     = (known after apply)
  + uploads_bucket_id      = (known after apply)
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.file_uploader.module.api_gateway.aws_api_gateway_account.account will be created%0A  + resource "aws_api_gateway_account" "account" {%0A      + api_key_version     = (known after apply)%0A      + cloudwatch_role_arn = (known after apply)%0A      + features            = (known after apply)%0A      + id                  = (known after apply)%0A      + region              = "eu-central-1"%0A      + throttle_settings   = (known after apply)%0A    }%0A%0A  # module.file_uploader.module.api_gateway.aws_api_gateway_base_path_mapping.api_mapping will be created%0A  + resource "aws_api_gateway_base_path_mapping" "api_mapping" {%0A      + api_id      = (known after apply)%0A      + domain_name = "staging-api-file-upload.epic-trip-planner.com"%0A      + id          = (known after apply)%0A      + region      = "eu-central-1"%0A      + stage_name  = "staging"%0A    }%0A%0A  # module.file_uploader.module.api_gateway.aws_api_gateway_deployment.deployment will be created%0A  + resource "aws_api_gateway_deployment" "deployment" {%0A      + created_date = (known after apply)%0A      + id           = (known after apply)%0A      + region       = "eu-central-1"%0A      + rest_api_id  = (known after apply)%0A      + triggers     = (known after apply)%0A    }%0A%0A  # module.file_uploader.module.api_gateway.aws_api_gateway_domain_name.api will be created%0A  + resource "aws_api_gateway_domain_name" "api" {%0A      + arn                                    = (known after apply)%0A      + certificate_upload_date                = (known after apply)%0A      + cloudfront_domain_name                 = (known after apply)%0A      + cloudfront_zone_id                     = (known after apply)%0A      + domain_name                            = "staging-api-file-upload.epic-trip-planner.com"%0A      + domain_name_id                         = (known after apply)%0A      + id                                     = (known after apply)%0A      + ownership_verification_certificate_arn = (known after apply)%0A      + region                                 = "eu-central-1"%0A      + regional_certificate_arn               = "arn:aws:acm:eu-central-1:387836084035:certificate/1543124e-071b-432e-af17-040651803d38"%0A      + regional_domain_name                   = (known after apply)%0A      + regional_zone_id                       = (known after apply)%0A      + security_policy                        = "TLS_1_2"%0A      + tags                                   = {%0A          + "App"         = "file-uploader"%0A          + "Environment" = "staging"%0A          + "Name"        = "staging-api-file-upload.epic-trip-planner.com"%0A        }%0A      + tags_all                               = {%0A          + "App"         = "file-uploader"%0A          + "Environment" = "staging"%0A          + "Name"        = "staging-api-file-upload.epic-trip-planner.com"%0A        }%0A%0A      + endpoint_configuration {%0A          + ip_address_type = (known after apply)%0A          + types           = [%0A              + "REGIONAL",%0A            ]%0A        }%0A    }%0A%0A  # module.file_uploader.module.api_gateway.aws_api_gateway_integration.lambda_integration will be created%0A  + resource "aws_api_gateway_integration" "lambda_integration" {%0A      + cache_namespace         = (known after apply)%0A      + connection_type         = "INTERNET"%0A      + http_method             = "GET"%0A      + id                      = (known after apply)%0A      + integration_http_method = "POST"%0A      + passthrough_behavior    = (known after apply)%0A      + region                  = "eu-central-1"%0A      + resource_id             = (known after apply)%0A      + rest_api_id             = (known after apply)%0A      + timeout_milliseconds    = 29000%0A      + type                    = "AWS_PROXY"%0A      + uri                     = (known after apply)%0A    }%0A%0A  # module.file_uploader.module.api_gateway.aws_api_gateway_integration.options_integration will be created%0A  + resource "aws_api_gateway_integration" "options_integration" {%0A      + cache_namespace      = (known after apply)%0A      + connection_type      = "INTERNET"%0A      + http_method          = "OPTIONS"%0A      + id                   = (known after apply)%0A      + passthrough_behavior = (known after apply)%0A      + region               = "eu-central-1"%0A      + request_templates    = {%0A          + "application/json" = jsonencode(%0A                {%0A                  + statusCode = 200%0A                }%0A            )%0A        }%0A      + resource_id          = (known after apply)%0A      + rest_api_id          = (known after apply)%0A      + timeout_milliseconds = 29000%0A      + type                 = "MOCK"%0A    }%0A%0A  # module.file_uploader.module.api_gateway.aws_api_gateway_integration_response.options_integration_response will be created%0A  + resource "aws_api_gateway_integration_response" "options_integration_response" {%0A      + http_method         = "OPTIONS"%0A      + id                  = (known after apply)%0A      + region              = "eu-central-1"%0A      + resource_id         = (known after apply)%0A      + response_parameters = {%0A          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,x-api-gateway-file-upload-auth,X-Requested-With,Accept,Origin'"%0A          + "method.response.header.Access-Control-Allow-Methods" = "'GET,OPTIONS,PUT'"%0A          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"%0A        }%0A      + rest_api_id         = (known after apply)%0A      + status_code         = "200"%0A    }%0A%0A  # module.file_uploader.module.api_gateway.aws_api_gateway_method.get_method will be created%0A  + resource "aws_api_gateway_method" "get_method" {%0A      + api_key_required   = false%0A      + authorization      = "NONE"%0A      + http_method        = "GET"%0A      + id                 = (known after apply)%0A      + region             = "eu-central-1"%0A      + request_parameters = {%0A          + "method.request.header.x-api-gateway-file-upload-auth" = true%0A        }%0A      + resource_id        = (known after apply)%0A      + rest_api_id        = (known after apply)%0A    }%0A%0A  # module.file_uploader.module.api_gateway.aws_api_gateway_method.options_method will be created%0A  + resource "aws_api_gateway_method" "options_method" {%0A      + api_key_required = false%0A      + authorization    = "NONE"%0A      + http_method      = "OPTIONS"%0A      + id               = (known after apply)%0A      + region           = "eu-central-1"%0A      + resource_id      = (known after apply)%0A      + rest_api_id      = (known after apply)%0A    }%0A%0A  # module.file_uploader.module.api_gateway.aws_api_gateway_method_response.options_response will be created%0A  + resource "aws_api_gateway_method_response" "options_response" {%0A      + http_method         = "OPTIONS"%0A      + id                  = (known after apply)%0A      + region              = "eu-central-1"%0A      + resource_id         = (known after apply)%0A      + response_models     = {%0A          + "application/json" = "Empty"%0A        }%0A      + response_parameters = {%0A          + "method.response.header.Access-Control-Allow-Headers" = true%0A          + "method.response.header.Access-Control-Allow-Methods" = true%0A          + "method.response.header.Access-Control-Allow-Origin"  = true%0A        }%0A      + rest_api_id         = (known after apply)%0A      + status_code         = "200"%0A    }%0A%0A  # module.file_uploader.module.api_gateway.aws_api_gateway_resource.file_upload_url_resource will be created%0A  + resource "aws_api_gateway_resource" "file_upload_url_resource" {%0A      + id          = (known after apply)%0A      + parent_id   = (known after apply)%0A      + path        = (known after apply)%0A      + path_part   = "upload-url"%0A      + region      = "eu-central-1"%0A      + rest_api_id = (known after apply)%0A    }%0A%0A  # module.file_uploader.module.api_gateway.aws_api_gateway_rest_api.api will be created%0A  + resource "aws_api_gateway_rest_api" "api" {%0A      + api_key_source               = (known after apply)%0A      + arn                          = (known after apply)%0A      + binary_media_types           = (known after apply)%0A      + created_date                 = (known after apply)%0A      + description                  = "API Gateway for requesting pre-signed url"%0A      + disable_execute_api_endpoint = (known after apply)%0A      + execution_arn                = (known after apply)%0A      + id                           = (known after apply)%0A      + minimum_compression_size     = (known after apply)%0A      + name                         = "staging-get-presigned-url-api"%0A      + policy                       = (known after apply)%0A      + region                       = "eu-central-1"%0A      + root_resource_id             = (known after apply)%0A      + tags                         = {%0A          + "App"         = "file-uploader"%0A          + "Environment" = "staging"%0A          + "Name"        = "staging-get-presigned-url-api"%0A        }%0A      + tags_all                     = {%0A          + "App"         = "file-uploader"%0A          + "Environment" = "staging"%0A          + "Name"        = "staging-get-presigned-url-api"%0A        }%0A    }%0A%0A  # module.file_uploader.module.api_gateway.aws_api_gateway_stage.api_gateway_stage will be created%0A  + resource "aws_api_gateway_stage" "api_gateway_stage" {%0A      + arn                  = (known after apply)%0A      + deployment_id        = (known after apply)%0A      + execution_arn        = (known after apply)%0A      + id                   = (known after apply)%0A      + invoke_url           = (known after apply)%0A      + region               = "eu-central-1"%0A      + rest_api_id          = (known after apply)%0A      + stage_name           = "staging"%0A      + tags_all             = (known after apply)%0A      + web_acl_arn          = (known after apply)%0A      + xray_tracing_enabled = true%0A%0A      + access_log_settings {%0A          + destination_arn = (known after apply)%0A          + format          = jsonencode(%0A                {%0A                  + caller         = "$context.identity.caller"%0A                  + httpMethod     = "$context.httpMethod"%0A                  + ip             = "$context.identity.sourceIp"%0A                  + protocol       = "$context.protocol"%0A                  + requestId      = "$context.requestId"%0A                  + requestTime    = "$context.requestTime"%0A                  + resourcePath   = "$context.resourcePath"%0A                  + responseLength = "$context.responseLength"%0A                  + status         = "$context.status"%0A                  + user           = "$context.identity.user"%0A                }%0A            )%0A        }%0A    }%0A%0A  # module.file_uploader.module.api_gateway.aws_cloudwatch_log_group.api_gateway will be created%0A  + resource "aws_cloudwatch_log_group" "api_gateway" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + log_group_class   = (known after apply)%0A      + name              = "/aws/apigw/staging-file-uploader"%0A      + name_prefix       = (known after apply)%0A      + region            = "eu-central-1"%0A      + retention_in_days = 30%0A      + skip_destroy      = false%0A      + tags_all          = (known after apply)%0A    }%0A%0A  # module.file_uploader.module.api_gateway.aws_cloudwatch_log_group.apigw_access_logs will be created%0A  + resource "aws_cloudwatch_log_group" "apigw_access_logs" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + log_group_class   = (known after apply)%0A      + name              = "/aws/apigateway/staging-file-uploader-access-logs"%0A      + name_prefix       = (known after apply)%0A      + region            = "eu-central-1"%0A      + retention_in_days = 30%0A      + skip_destroy      = false%0A      + tags_all          = (known after apply)%0A    }%0A%0A  # module.file_uploader.module.api_gateway.aws_iam_role.cloudwatch_role will be created%0A  + resource "aws_iam_role" "cloudwatch_role" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "apigateway.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "staging-apigw-cloudwatch-role"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A    }%0A%0A  # module.file_uploader.module.api_gateway.aws_iam_role_policy_attachment.cloudwatch_attachment will be created%0A  + resource "aws_iam_role_policy_attachment" "cloudwatch_attachment" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonAPIGatewayPushToCloudWatchLogs"%0A      + role       = "staging-apigw-cloudwatch-role"%0A    }%0A%0A  # module.file_uploader.module.api_gateway.aws_lambda_permission.apigw_permission will be created%0A  + resource "aws_lambda_permission" "apigw_permission" {%0A      + action              = "lambda:InvokeFunction"%0A      + function_name       = (known after apply)%0A      + id                  = (known after apply)%0A      + principal           = "apigateway.amazonaws.com"%0A      + region              = "eu-central-1"%0A      + source_arn          = (known after apply)%0A      + statement_id        = "AllowAPIGatewayInvoke"%0A      + statement_id_prefix = (known after apply)%0A    }%0A%0A  # module.file_uploader.module.dynamodb.aws_dynamodb_table.files_metadata_table will be created%0A  + resource "aws_dynamodb_table" "files_metadata_table" {%0A      + arn                         = (known after apply)%0A      + billing_mode                = "PAY_PER_REQUEST"%0A      + deletion_protection_enabled = false%0A      + hash_key                    = "id"%0A      + id                          = (known after apply)%0A      + name                        = "staging-files-metadata"%0A      + range_key                   = "file_key"%0A      + read_capacity               = (known after apply)%0A      + region                      = "eu-central-1"%0A      + stream_arn                  = (known after apply)%0A      + stream_label                = (known after apply)%0A      + stream_view_type            = (known after apply)%0A      + tags                        = {%0A          + "App"         = "file-uploader"%0A          + "Environment" = "staging"%0A        }%0A      + tags_all                    = {%0A          + "App"         = "file-uploader"%0A          + "Environment" = "staging"%0A        }%0A      + write_capacity              = (known after apply)%0A%0A      + attribute {%0A          + name = "file_key"%0A          + type = "S"%0A        }%0A      + attribute {%0A          + name = "id"%0A          + type = "S"%0A        }%0A%0A      + point_in_time_recovery {%0A          + enabled                 = true%0A          + recovery_period_in_days = (known after apply)%0A        }%0A%0A      + server_side_encryption {%0A          + enabled     = true%0A          + kms_key_arn = (known after apply)%0A        }%0A    }%0A%0A  # module.file_uploader.module.file_scanning.aws_lambda_permission.allow_s3

...(truncated)
```

</details>